app/controllers/stocks_controller.rb

SELECT  "stocks".* FROM "stocks" WHERE "stocks"."ticker" = ?  ORDER BY "stocks"."id" ASC LIMIT 1  [["ticker", "GOOG"]]
---
def search

if params[:stock]

@stock = Stock.find_by_ticker(params[:stock])